<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Повторение пройденного материала</title>
</head>
<body>
    <h3>Задачник по PHP.</h3>
    <h4><i>А.Григорьев, 2018</i></h4>
    <h3>1.Простейшая арифметика</h3>
    <p><a href="1/1.php" target="_blank">1.Даны два числа 5 и 7. Найти их сумму и произведение.</a></p>
    <p><a href="2/2.php" target="_blank">2.Даны два числа 4 и 6. Найдите сумму их квадратов.</a></p>
    <p><a href="3/3.php" target="_blank">3.Даны три числа 3, 5, 8. Найдите их среднее арифметическое.</a></p>
    <p><a href="4/4.php" target="_blank">4.Даны три числа x = 2,y = 6 и z = 9. Найдите (x+1)4−2(z−2x^2+y^2).</a></p>
    <p><a href="5/5.php" target="_blank">5.Даны три ненулевых числа $a = 4, $b = 8, $c = 3. Найдите всевозможные результаты деления суммы двух из них на оставшееся третье число.</a></p>
    <p><a href="6/6.php" target="_blank">6.Дано два числа 17 и 54. Найдите сумму 40% от первого числа и 84% от второго числа.</a></p>
    <p><a href="7/7.php" target="_blank">7.Дано трехзначное числа. Найдите сумму его цифр.</a></p>
    <h3>2.Условный оператор</h3>
    <p><a href="8/8.php" target="_blank">8.Дано число $number. Если оно больше 10, то увеличьте его на 100, иначе уменьшите на 30.</a></p>
    <p><a href="9/9.php" target="_blank">9.Дано натуральное число $number. Если оно четное, то уменьшите его в 2 раза, иначе увеличьте в 3 раза.</a></p>
    <p><a href="10/10.php" target="_blank">10.Дано число. Если оно не меньше 50, то выведите квадрат этого числа, если же
        это число больше 10 и меньше 30, то выведите ноль, в остальных случаях выведите
        слово "Ошибка".</a></p>
    <p><a href="11/11.php" target="_blank">11.Дано два числа $a и $b. Вывести наибольшее из них.</a></p>
    <p><a href="12/12.php" target="_blank">12.Дано два числа $a и $b. Вывести 'Да', если они отличаются на 100, иначе вывести 'Нет'.</a></p>
    <p><a href="13/13.php" target="_blank">13.В данном трехзначном числе переставьте цифры так, чтобы новое число оказалось наибольшим из возможных.</a></p>
    <p><a href="14/14.html" target="_blank">14.Пользователь вводит номер дня недели. Вывести название дня недели.</a></p>
    <p><a href="15/15.html" target="_blank">15.Пользователь вводит свой возраст. Если он больше 80 лет, то вывести 'Здравствуйте, уважаемый', иначе 'Успехов!'.</a></p>
    <p><a href="16/16.html" target="_blank">16.Пользователь выбирает из выпадающего списка страну (Турция, Египет или
        Италия), вводит количество дней для отдыха и указывает, есть ли у него скидка (чекбокс). Вывести стоимость отдыха, которая вычисляется как произведение количества дней на 400. Далее это число увеличивается на 10%, если выбран Египет, и на 12%, если выбрана Италия. И далее это число уменьшается на 5%, если указана скидка.</a></p>
    <h3>3.Массивы</h3>        
    <p><a href="17/17.php" target="_blank">17.Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо вывести на экран фразу 'Привет, мир!'.</a></p>
    <p><a href="18/18.php" target="_blank">18.Дан массив с элементами 'Привет, ', 'мир' и '!'. Необходимо записать в переменную $text фразу 'Привет, мир!', а затем вывести на экран содержимое этой переменной.</a></p>        
    <p><a href="19/19.php" target="_blank">19.Дан массив ['Привет, ', 'мир', '!']. Необходимо записать в первый элемент (то
        есть элемент с номером ноль) этого массива слово 'Пока, ' (то есть вместо
        слова 'Привет, ' будет 'Пока, ' ).</a></p>
    <p><a href="20/20.php" target="_blank">20.Дан массив с числами. Запишите в новый массив только те числа, в которых есть цифра 5.</a></p>               
    <p><a href="21/21.php" target="_blank">21.Задача «Cтранный массив»*: Создайте массив вида [1, [2], [[3]], [[[4]]] ], вместо 4 может быть любое целое значение. К примеру, если 5 – тогда будет массив [1, [2], [[3]], [[[4]]], [[[[5]]]] ].</a></p>                    
    <p><a href="22/22.php" target="_blank">22.Задача «Хитрое слияние массивов»*</a></p>               
    <p><a href="23/23.php" target="_blank">23.Дан массив вида [1, ' , 2, ' , ' , 3] – то есть в нем есть пустые строки. Удалите все такие элементы из этого массива.*</a></p>               
    <p><a href="24/24.php" target="_blank">24.Напишите функцию, которая корректно будет складывать часы и минуты. Примеры: на вход функции подается такое – 1ч20мин+50мин – в результатте функция выведет 2ч10мин.*** (Задача решается разными способами, приведите пример одного из них)</a></p>                   
    <h3>4.Ассоциативные массивы</h3>
    <p><a href="25/25.php" target="_blank">25.Создайте массив заработных плат $arr. Выведите на экран зарплату Коли.</a></p>                   
    <p><a href="26/26.php" target="_blank">26.Создайте массив $arr с элементами 1, 2, 3, 4, 5 двумя различными способами.</a></p>                   
    <p><a href="27/27.php" target="_blank">27.Создайте массив $arr. a =>1, b=>2, c=>3. Выведите на экран элемент с ключом 'b'.</a></p>                   
    <p><a href="28/28.php" target="_blank">28.Создайте массив $arr. Найдите сумму элементов этого массива.</a></p>                       
    <p><a href="29/29.php" target="_blank">29.Создайте ассоциативный массив дней недели. Ключами в нем должны служить номера дней от начала недели (понедельник – должен иметь ключ 1, вторник – 2 и т.д.). Выведите на экран текущийдень недели.( например сегодня – четверг).</a></p>        
    <h3>5.Многомерные массивы</h3>                         
    <p><a href="30/30.php" target="_blank">30.Дан многомерный массив. Выведите с его помощью первое слово массива -  "azul".</a></p>    
    <p><a href="31/31.php" target="_blank">31.Создайте массив $arr=['a', 'b', 'c']. Выведите значение массива на экран с помощью функции var_dump(). С помощью массива $arr из предыдущего номера выведите на экран содержимое первого, второго и третьего элементов.</a></p>    
    <p><a href="32/32.php" target="_blank">32.Создайте массив $arr=['a', 'b', 'c', 'd'] и с его помощью выведите на экран строку 'a+b, c+d'.</a></p>        
    <p><a href="33/33.php" target="_blank">33.Создайте массив $arr с элементами 2, 8, 5, 3.Умножьте первый элемент массива на второй, а третий элемент на четвертый. Результаты сложите, присвойте переменной $a. Выведите на экран значение этой переменной.</a></p>        
    <p><a href="34/34.php" target="_blank">34.Заполните массив $arr числами от 1 до 5. Не объявляйте массив, а просто заполните его присваиванием $arr[] = новое значение.</a></p>        
    <p><a href="35/35.php" target="_blank">35.Создайте многомерный массив $arr. $arr = ['cms'=>['joomla', 'wordpress', 'drupal'], 'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']] С его помощью выведите на экран слова 'joomla', 'drupal', 'зеленый', 'красный’.</a></p>            
    
</body>
</html>